tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "oven-sh/bun"
brew "atuin"
brew "awscli"
brew "bat"
brew "bottom"
brew "carapace"
brew "direnv"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "htop"
brew "just"
brew "kubernetes-cli"
brew "lazygit"
brew "make"
brew "minikube"
brew "mole"
brew "ncdu"
brew "oasdiff"
brew "stow"
brew "tree"
brew "yt-dlp"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "oven-sh/bun/bun"
cask "affinity"
cask "appcleaner"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "cryptomator"
cask "daisydisk"
cask "excalidrawz"
cask "filen"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-victor-mono"
cask "ghostty"
cask "google-chrome"
cask "handbrake-app"
cask "httpie-desktop"
cask "keepingyouawake"
cask "keka"
cask "maccy"
cask "macfuse"
cask "macwhisper"
cask "mullvad-browser"
cask "nordvpn"
cask "obs"
cask "postman"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "raycast"
cask "rectangle"
cask "session"
cask "spotify"
cask "standard-notes"
cask "syncthing-app"
cask "tailscale-app"
cask "telegram"
cask "thor"
cask "tor-browser"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wireshark-app"
cask "zed"
cask "zen"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"
