tap "anomalyco/tap"
tap "docker/tap"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "iina/mpv-iina"
tap "jandedobbeleer/oh-my-posh"
tap "modem-dev/tap"
tap "mohokh67/portly"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "xykong/tap"
# Apple Intelligence from the command-line, with OpenAi-compatible API server
brew "apfel"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Multi-shell multi-command argument completer
brew "carapace"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Statistics utility to count lines of code
brew "cloc"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Load/unload environment variables based on $PWD
brew "direnv"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# Deep clean and optimize your Mac
brew "mole"
# NCurses Disk Usage
brew "ncdu"
# OpenAPI Diff and Breaking Changes
brew "oasdiff"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Image editing and design software
cask "affinity"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Send any size file between devices
cask "blip"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Disk space visualiser
cask "daisydisk"
# Window peeking utility app
cask "dockdoor"
# Utility to support moving and resizing using a modifier key and mouse drag
cask "easy-move+resize"
# Desktop client for Ente Auth
cask "ente-auth"
# Excalidraw client
cask "excalidrawz"
# Desktop client for Filen.io
cask "filen"
# Markdown previews in Finder QuickLook with diagrams and math
cask "xykong/tap/flux-markdown"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Break time reminder app
cask "lookaway"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Speech recognition tool
cask "macwhisper"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Onion routing based messenger
cask "session"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# System monitor for the menu bar
cask "stats"
# Real time file synchronisation software
cask "syncthing-app"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Real-time voice changer and soundboard
cask "voicemod"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"
npm "corepack"
